---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndMx
source: html/058cd29b-19fc-ed5f-5073-66411208729b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndMx Property

"End Mx"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalMemberForceEndMx { get; }
```